Repository: common-repository/blighty-explorer
Catalog: languages/blighty-explorer-*.po
Languages: nl_nl

source: Date
nl_nl: Datum

source: Size
nl_nl: Grootte

source: Select file to upload:
nl_nl: Selecteer een document om te uploaden:

source: Upload
nl_nl: Uploaden

source: Ready to upload.
nl_nl: Klaar om te uploaden

source: No access.
nl_nl: Geen toegang.

source: No file selected.
nl_nl: Geen document geselecteerd.

source: This type of file is not allowed.
nl_nl: Dit type document is niet toegestaan.

source: File uploaded. Ready for next file.
nl_nl: Document ge√ºpload. Klaar voor het volgende document.

source: Provides an easy integrateable layer between a folder hierarchy on Dropbox and the website.
nl_nl: Geeft een eenvoudig te integreren laag tussen een mapstructuur in Dropbox en de website.

source: You do not have access to this folder.
nl_nl: U hebt geen toegang tot deze map.

source: Name
nl_nl: Naam
